# PANDAS

## DAY2

* PANDAS DATAFRAME

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
t=pd.DataFrame([1,2,3],[4,5,6])

In [6]:
t

   0
4  1
5  2
6  3

In [7]:
t1=pd.DataFrame([1,2,3,4,5,6,7,8,9])

In [9]:
t1

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [10]:
t2=pd.DataFrame([[1,2,3,4,5,6,7,8,9],[11,22,33,44,55,66,77,88,99],[12,13,14,15,16,17,18,19]])

In [11]:
t2

    0   1   2   3   4   5   6   7     8
0   1   2   3   4   5   6   7   8   9.0
1  11  22  33  44  55  66  77  88  99.0
2  12  13  14  15  16  17  18  19   NaN

In [12]:
type(t2)

pandas.core.frame.DataFrame

In [16]:
t2.shape

(3, 9)

In [17]:
t2.dtypes

0      int64
1      int64
2      int64
3      int64
4      int64
5      int64
6      int64
7      int64
8    float64
dtype: object

In [18]:
t2.head()

    0   1   2   3   4   5   6   7     8
0   1   2   3   4   5   6   7   8   9.0
1  11  22  33  44  55  66  77  88  99.0
2  12  13  14  15  16  17  18  19   NaN

In [19]:
t2.head(2)

    0   1   2   3   4   5   6   7     8
0   1   2   3   4   5   6   7   8   9.0
1  11  22  33  44  55  66  77  88  99.0

In [20]:
t2.tail()

    0   1   2   3   4   5   6   7     8
0   1   2   3   4   5   6   7   8   9.0
1  11  22  33  44  55  66  77  88  99.0
2  12  13  14  15  16  17  18  19   NaN

In [21]:
t2.sample(2)

    0   1   2   3   4   5   6   7    8
2  12  13  14  15  16  17  18  19  NaN
0   1   2   3   4   5   6   7   8  9.0

In [22]:
t3=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})

In [23]:
t3

   a  b
0  1  4
1  2  5
2  3  6

In [27]:
t4=pd.DataFrame({'a':[1,np.nan,3],'b':[4,5,6]}) #here the null values can be created using np.nan only

In [26]:
t4

     a  b
0  1.0  4
1  NaN  5
2  3.0  6

In [28]:
t5=pd.DataFrame({'a':[1,'missing',3],'b':[4,5,'missing']})

In [29]:
t5

         a        b
0        1        4
1  missing        5
2        3  missing

In [32]:
t

   col1  col2  col3
a     1     2     3
b     4     5     6

In [34]:
t.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [35]:
t.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, a to b
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    2 non-null      int64
 1   col2    2 non-null      int64
 2   col3    2 non-null      int64
dtypes: int64(3)
memory usage: 64.0+ bytes

In [36]:
t.describe()

          col1     col2     col3
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

In [37]:
t['col1']

a    1
b    4
Name: col1, dtype: int64

In [41]:
t['col2']

a    2
b    5
Name: col2, dtype: int64

In [42]:
t['col1'].max()

4

In [43]:
t['col2'].min()

2

In [44]:
t[['col1','col2']]

   col1  col2
a     1     2
b     4     5

In [46]:
t2=pd.DataFrame([[100,250,333],[411,55,6],[1,2,3]],index=list('abc'),columns=['col1','col2','col3'])

In [47]:
t2

   col1  col2  col3
a   100   250   333
b   411    55     6
c     1     2     3

In [48]:
t2['col2']>50

a     True
b     True
c    False
Name: col2, dtype: bool

In [50]:
t2[t2['col1']>50]

   col1  col2  col3
a   100   250   333
b   411    55     6

In [52]:
t2[t2['col1']>50]['col1'] #to get values only for column 1

a    100
b    411
Name: col1, dtype: int64

In [6]:
t3=pd.DataFrame([[100,250,333],[411,55,6],[1,2,3]],columns=['col1','col2','col3'])

In [7]:
t3

   col1  col2  col3
0   100   250   333
1   411    55     6
2     1     2     3

In [65]:
t3.loc[0,'col1']

100

In [67]:
t3.loc[[0,1,2],'col1']

0    100
1    411
2      1
Name: col1, dtype: int64

In [68]:
t3.loc[:3,'col1']

0    100
1    411
2      1
Name: col1, dtype: int64

In [15]:
t3.iloc[1:3,1:2] #see the changee hereee

   col2
1    55
2     2

In [14]:
t3.iloc[1:3,0:2]

   col1  col2
1   411    55
2     1     2

In [76]:
t2=pd.DataFrame([[100,250,333],[34,65,54],[33,343,411],[55,6,34],[65,33,45],[1,2,3],[45,65,33]])

In [77]:
t2

     0    1    2
0  100  250  333
1   34   65   54
2   33  343  411
3   55    6   34
4   65   33   45
5    1    2    3
6   45   65   33

In [78]:
t2.iloc[4:7,1:3]

    1   2
4  33  45
5   2   3
6  65  33

In [79]:
t2.iloc[1:4,0:3]

    0    1    2
1  34   65   54
2  33  343  411
3  55    6   34